[
  {
    "name": "assetTurnoverTTM",
    "direction": 1,
    "description": "Measures the efficiency of a company in generating sales from its assets. It indicates how well a company is utilizing its assets to generate revenue."
  },
  {
    "name": "capitalExpenditureCoverageRatioTTM",
    "direction": 1,
    "description": "Measures a company's ability to generate enough cash flow to cover its capital expenditures. It indicates the company's ability to fund its investments in fixed assets."
  },
  {
    "name": "cashConversionCycleTTM",
    "direction": -1,
    "description": "Measures the time it takes for a company to convert its investments in inventory and other resources into cash flows from sales. It indicates the efficiency of a company's working capital management."
  },
  {
    "name": "cashFlowCoverageRatiosTTM",
    "direction": 1,
    "description": "Measures a company's ability to generate enough cash flow to cover its financial obligations, such as interest payments and debt repayments. It indicates the company's ability to meet its financial obligations."
  },
  {
    "name": "cashFlowToDebtRatioTTM",
    "direction": 1,
    "description": "Measures a company's ability to generate cash flow from its operations relative to its total debt. It indicates the company's ability to generate enough cash flow to service its debt."
  },
  {
    "name": "cashPerShareTTM",
    "direction": 1,
    "description": "Measures the amount of cash available to common shareholders per share of common stock. It indicates the liquidity position of a company and its ability to distribute cash to shareholders."
  },
  {
    "name": "cashRatioTTM",
    "direction": 1,
    "description": "Measures a company's ability to cover its short-term liabilities with its cash and cash equivalents. It indicates the liquidity position of a company and its ability to meet its short-term obligations."
  },
  {
    "name": "companyEquityMultiplierTTM",
    "direction": -1,
    "description": "Measures the proportion of a company's total assets that are financed by its shareholders' equity. It indicates the extent to which a company relies on equity financing compared to debt financing."
  },
  {
    "name": "currentRatioTTM",
    "direction": 1,
    "description": "Measures a company's ability to cover its short-term liabilities with its short-term assets. It indicates the liquidity position of a company and its ability to meet its short-term obligations."
  },
  {
    "name": "daysOfInventoryOutstandingTTM",
    "direction": -1,
    "description": "Measures the average number of days it takes for a company to sell its inventory. It indicates the efficiency of a company's inventory management and the speed at which it can convert inventory into sales."
  },
  {
    "name": "daysOfPayablesOutstandingTTM",
    "direction": 1,
    "description": "Measures the average number of days it takes for a company to pay its suppliers. It indicates the efficiency of a company's accounts payable management and the time it takes to settle its payables."
  },
  {
    "name": "daysOfSalesOutstandingTTM",
    "direction": -1,
    "description": "Measures the average number of days it takes for a company to collect payment from its customers. It indicates the efficiency of a company's accounts receivable management and the time it takes to convert sales into cash."
  },
  {
    "name": "debtEquityRatioTTM",
    "direction": -1,
    "description": "Measures the proportion of a company's total debt to its shareholders' equity. It indicates the extent to which a company relies on debt financing compared to equity financing."
  },
  {
    "name": "debtRatioTTM",
    "direction": -1,
    "description": "Measures the proportion of a company's total assets that are financed by debt. It indicates the extent to which a company relies on debt financing compared to equity financing."
  },
  {
    "name": "dividendPaidAndCapexCoverageRatioTTM",
    "description": "Measures a company's ability to generate enough cash flow to cover its dividend payments and capital expenditures. It indicates the company's ability to fund its dividend payments and investments in fixed assets."
  },
  {
    "name": "dividendYielTTM",
    "description": "Measures the dividend income generated by an investment relative to its market price. It indicates the return on investment from dividends received."
  },
  {
    "name": "ebitPerRevenueTTM",
    "direction": 1,
    "description": "Measures a company's operating profitability as a percentage of its revenue. It indicates the company's ability to generate operating profit from its revenue."
  },
  {
    "name": "ebtPerEbitTTM",
    "direction": 1,
    "description": "Measures a company's ability to generate earnings before taxes (EBT) relative to its earnings before interest and taxes (EBIT). It indicates the company's ability to generate earnings before taxes from its operating profit."
  },
  {
    "name": "effectiveTaxRateTTM",
    "direction": -1,
    "description": "Measures the proportion of a company's pre-tax income that is paid in taxes. It indicates the company's tax efficiency and the impact of taxes on its profitability."
  },
  {
    "name": "enterpriseValueMultipleTTM",
    "direction": -1,
    "description": "Measures the ratio of a company's enterprise value to its earnings before interest, taxes, depreciation, and amortization (EBITDA). It indicates the valuation of a company relative to its EBITDA."
  },
  {
    "name": "fixedAssetTurnoverTTM",
    "direction": 1,
    "description": "Measures the efficiency of a company in generating sales from its fixed assets. It indicates how well a company is utilizing its fixed assets to generate revenue."
  },
  {
    "name": "freeCashFlowOperatingCashFlowRatioTTM",
    "direction": 1,
    "description": "Measures the proportion of a company's operating cash flow that is available for discretionary purposes after deducting capital expenditures. It indicates the company's ability to generate free cash flow from its operating activities."
  },
  {
    "name": "freeCashFlowPerShareTTM",
    "direction": 1,
    "description": "Measures the amount of free cash flow available to common shareholders per share of common stock. It indicates the cash flow generated by a company that is available to distribute to shareholders after deducting capital expenditures."
  },
  {
    "name": "grossProfitMarginTTM",
    "direction": 1,
    "description": "Measures a company's gross profit as a percentage of its revenue. It indicates the company's ability to generate profit from its revenue after deducting the cost of goods sold."
  },
  {
    "name": "interestCoverageTTM",
    "direction": 1,
    "description": "Measures a company's ability to cover its interest expenses with its operating income. It indicates the company's ability to meet its interest obligations from its operating profit."
  },
  {
    "name": "inventoryTurnoverTTM",
    "direction": 1,
    "description": "Measures the number of times a company's inventory is sold and replaced during a specific period. It indicates the efficiency of a company's inventory management and the speed at which it can convert inventory into sales."
  },
  {
    "name": "longTermDebtToCapitalizationTTM",
    "direction": -1,
    "description": "Measures the proportion of a company's long-term debt to its total capitalization. It indicates the extent to which a company relies on long-term debt financing compared to equity financing."
  },
  {
    "name": "netIncomePerEBTTTM",
    "description": "Measures a company's net income as a percentage of its earnings before taxes (EBT). It indicates the company's ability to generate net income from its pre-tax earnings."
  },
  {
    "name": "netProfitMarginTTM",
    "description": "Measures a company's net income as a percentage of its revenue. It indicates the company's ability to generate profit from its revenue after deducting all expenses and taxes."
  },
  {
    "name": "operatingCashFlowPerShareTTM",
    "direction": 1,
    "description": "Measures the amount of operating cash flow available to common shareholders per share of common stock. It indicates the cash flow generated by a company's operating activities that is available to distribute to shareholders."
  },
  {
    "name": "operatingCashFlowSalesRatioTTM",
    "description": "Measures a company's operating cash flow as a percentage of its revenue. It indicates the company's ability to generate cash flow from its operating activities relative to its revenue."
  },
  {
    "name": "operatingCycleTTM",
    "description": "Measures the average number of days it takes for a company to convert its investments in inventory and accounts receivable into cash flows from sales. It indicates the efficiency of a company's working capital management and the time it takes to convert its investments into cash."
  },
  {
    "name": "operatingProfitMarginTTM",
    "description": "Measures a company's operating profit as a percentage of its revenue. It indicates the company's ability to generate profit from its revenue after deducting all operating expenses."
  },
  {
    "name": "payablesTurnoverTTM",
    "description": "Measures the number of times a company pays its suppliers during a specific period. It indicates the efficiency of a company's accounts payable management and the speed at which it settles its payables."
  },
  {
    "name": "payoutRatioTTM",
    "description": "Measures the proportion of a company's earnings that is paid out as dividends to its shareholders. It indicates the portion of a company's earnings that is distributed to shareholders as cash dividends."
  },
  {
    "name": "pretaxProfitMarginTTM",
    "description": "Measures a company's pre-tax profit as a percentage of its revenue. It indicates the company's ability to generate profit from its revenue before deducting taxes."
  },
  {
    "name": "priceBookValueRatioTTM",
    "description": "Measures the ratio of a company's market price per share to its book value per share. It indicates the valuation of a company relative to its book value."
  },
  {
    "name": "priceCashFlowRatioTTM",
    "direction": -1,
    "description": "Measures the ratio of a company's market price per share to its cash flow per share. It indicates the valuation of a company relative to its cash flow."
  },
  {
    "name": "priceEarningsRatioTTM",
    "direction": -1,
    "description": "Measures the ratio of a company's market price per share to its earnings per share. It indicates the valuation of a company relative to its earnings."
  },
  {
    "name": "priceEarningsToGrowthRatioTTM",
    "description": "Measures the ratio of a company's price-earnings (P/E) ratio to its earnings growth rate. It indicates the valuation of a company relative to its earnings growth potential."
  },
  {
    "name": "priceFairValueTTM",
    "description": "Measures the ratio of a company's market price per share to its fair value per share. It indicates the valuation of a company relative to its fair value."
  },
  {
    "name": "priceSalesRatioTTM",
    "description": "Measures the ratio of a company's market price per share to its revenue per share. It indicates the valuation of a company relative to its revenue."
  },
  {
    "name": "priceToBookRatioTTM",
    "description": "Measures the ratio of a company's market price per share to its book value per share. It indicates the valuation of a company relative to its book value."
  },
  {
    "name": "priceToFreeCashFlowsRatioTTM",
    "description": "Measures the ratio of a company's market price per share to its free cash flow per share. It indicates the valuation of a company relative to its free cash flow."
  },
  {
    "name": "priceToOperatingCashFlowsRatioTTM",
    "description": "Measures the ratio of a company's market price per share to its operating cash flow per share. It indicates the valuation of a company relative to its operating cash flow."
  },
  {
    "name": "priceToSalesRatioTTM",
    "description": "Measures the ratio of a company's market price per share to its revenue per share. It indicates the valuation of a company relative to its revenue."
  },
  {
    "name": "quickRatioTTM",
    "description": "Measures a company's ability to cover its short-term liabilities with its quick assets, which include cash, cash equivalents, and accounts receivable. It indicates the liquidity position of a company and its ability to meet its short-term obligations without relying on inventory."
  },
  {
    "name": "receivablesTurnoverTTM",
    "description": "Measures the number of times a company collects payment from its customers during a specific period. It indicates the efficiency of a company's accounts receivable management and the speed at which it converts sales into cash."
  },
  {
    "name": "returnOnAssetsTTM",
    "direction": 1,
    "description": "Measures a company's profitability relative to its total assets. It indicates the company's ability to generate profit from its assets."
  },
  {
    "name": "returnOnCapitalEmployedTTM",
    "description": "Measures a company's profitability relative to its capital employed, which includes both equity and debt financing. It indicates the company's ability to generate profit from its total capital."
  },
  {
    "name": "returnOnEquityTTM",
    "description": "Measures a company's profitability relative to its shareholders' equity. It indicates the company's ability to generate profit from its shareholders' investment."
  },
  {
    "name": "shortTermCoverageRatiosTTM",
    "description": "Measures a company's ability to cover its short-term liabilities with its short-term assets. It indicates the liquidity position of a company and its ability to meet its short-term obligations."
  },
  {
    "name": "totalDebtToCapitalizationTTM",
    "description": "Measures the proportion of a company's total debt to its total capitalization. It indicates the extent to which a company relies on debt financing compared to equity financing."
  }
]
